Revit 2027 API
IExtElemChangeBeamSection Interface
 Interface Change Beam section functionality to be implemented in add-ins
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExtElemChangeBeamSection
Public Interface IExtElemChangeBeamSection
public interface class IExtElemChangeBeamSection
type IExtElemChangeBeamSection = interface end
The IExtElemChangeBeamSection type exposes the following members.
Methods
Name | Description
ChangeSection |  The method that will be called when user wants to change beam section
Top
See Also
Reference
Autodesk.Revit.DB.Structure Namespace